---
type: DWFExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 12
tags: [revit-api, class]
---

# DWFExportOptions

`Autodesk.Revit.DB.DWFExportOptions` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DWFExportOptions | — | `public DWFExportOptions ()` |
| Property | CropBoxVisible | 2015 | `public bool CropBoxVisible { get ; set ; }` |
| Property | ExportObjectData | — | `public bool ExportObjectData { get ; set ; }` |
| Property | ExportOnlyViewId | 2019 | `public ElementId ExportOnlyViewId { get ; set ; }` |
| Property | ExportTexture | 2015 Subscription Update | `public bool ExportTexture { get ; set ; }` |
| Property | ExportingAreas | — | `public bool ExportingAreas { get ; set ; }` |
| Property | ImageFormat | — | `public DWFImageFormat ImageFormat { get ; set ; }` |
| Property | ImageQuality | — | `public DWFImageQuality ImageQuality { get ; set ; }` |
| Property | MergedViews | — | `public bool MergedViews { get ; set ; }` |
| Property | PaperFormat | — | `public ExportPaperFormat PaperFormat { get ; set ; }` |
| Property | PortraitLayout | — | `public bool PortraitLayout { get ; set ; }` |
| Property | StopOnError | — | `public bool StopOnError { get ; set ; }` |